import './OrderBookAnimatorExplanation.css';

function OrderBookAnimatorExplanation() {
  return (
    <div className="orderbook-animator-explanation">
      <h3> Объяснение графика "Глубина стакана" </h3>
      <p>
        В отличие от графиков, которые показывают усреднённую или агрегированную информацию, анимация даёт возможность 
        увидеть <strong>точные действия участников рынка</strong> — где появлялись крупные заявки, когда исчезали «стены», 
        как реагировали покупатели и продавцы на движение цены.
      </p>

      <h4>📊 Что можно увидеть:</h4>
      <ul>
        <li>⏱ появление/исчезновение крупных лимитных ордеров (манипуляции, страх, ликвидации)</li>
        <li>⚖️ смену доминирующей стороны — BID → ASK или наоборот</li>
        <li>📉 резкое опустошение уровней — как предвестник импульса</li>
        <li>🧠 поведение ликвидности в моменте — в отличие от её итогового состояния</li>
      </ul>
    </div>
  );
}

export default OrderBookAnimatorExplanation;
